Repository: baleboy/hsl-widget
Catalog: HslWidget/Localizable.xcstrings
Source language: en
Languages: fi, sv

source: • Filtered
fi: • Suodatettu
sv: • Filtrerad

source: Add Favorite Stop
fi: Lisää suosikkipysäkki
sv: Lägg till favoritstation

source: Add the widget
fi: Lisää widget
sv: Lägg till widgeten

source: Add Widget
fi: Lisää widget
sv: Lägg till widget

source: Add your favorite stops
fi: Lisää suosikkipysäkkisi
sv: Lägg till dina favoritstationer

source: Allow location access so the widget automatically shows departures from the stop closest to you.
fi: Salli sijainnin käyttö, jotta widget näyttää automaattisesti lähimmän pysäkin lähdöt.
sv: Tillåt platsåtkomst så att widgeten automatiskt visar avgångar från hållplatsen närmast dig.

source: Always
fi: Aina
sv: Alltid

source: Automatically update widget when you move
fi: Päivitä widget automaattisesti liikkuessasi
sv: Uppdatera widget automatiskt när du rör dig

source: Background Location Updates
fi: Taustapaikannuspäivitykset
sv: Bakgrundsplatsuppdateringar

source: Battery Impact: Minimal
fi: Akkuvaikutus: Minimaalinen
sv: Batterieffekt: Minimal

source: Cancel
fi: Peruuta
sv: Avbryt

source: Clears all UserDefaults including onboarding state. App will restart in onboarding mode.
fi: Tyhjentää kaikki asetukset. Sovellus käynnistyy uudelleen aloitustilassa.
sv: Rensar alla inställningar. Appen startar om i introduktionsläge.

source: Configure Filters
fi: Määritä suodattimet
sv: Konfigurera filter

source: Continue
fi: Jatka
sv: Fortsätt

source: Debug
fi: Vianetsintä
sv: Felsökning

source: Denied
fi: Estetty
sv: Nekad

source: Done
fi: Valmis
sv: Klar

source: e.g., Kamppi, Keskusta
fi: esim. Kamppi, Keskusta
sv: t.ex. Kamppi, Centrum

source: Enable Location
fi: Ota sijainti käyttöön
sv: Aktivera plats

source: Favorite stops
fi: Suosikkipysäkit
sv: Favoritstationer

source: Favorites
fi: Suosikit
sv: Favoriter

source: Filter by Destination
fi: Suodata määränpään mukaan
sv: Filtrera efter destination

source: Filter by line or direction
fi: Suodata linjan tai suunnan mukaan
sv: Filtrera efter linje eller riktning

source: Filter by Lines
fi: Suodata linjojen mukaan
sv: Filtrera efter linjer

source: Filters Active
fi: Suodattimet aktiiviset
sv: Filter aktiva

source: Find "HSL Widget" and add it
fi: Etsi "HSL Widget" ja lisää se
sv: Hitta "HSL Widget" och lägg till den

source: Find Stops
fi: Etsi pysäkkejä
sv: Hitta stationer

source: Got it
fi: Selvä
sv: Förstått

source: Help
fi: Ohje
sv: Hjälp

source: How many departures to show in the lock screen
fi: Montako lähtöä näytetään lukitusnäytöllä
sv: Hur många avgångar som ska visas på låsskärmen

source: How to Add Widget
fi: Kuinka lisätä widget
sv: Så lägger du till widget

source: I'll do this later
fi: Teen tämän myöhemmin
sv: Jag gör det senare

source: List
fi: Lista
sv: Lista

source: Loaded %lld/%lld stops...
fi: Ladattu %lld/%lld pysäkkiä...
sv: Laddat %lld/%lld stationer...

source: Loading %lld nearby stops...
fi: Ladataan %lld lähipysäkkiä...
sv: Laddar %lld närliggande stationer...

source: Loading available lines...
fi: Ladataan saatavilla olevia linjoja...
sv: Laddar tillgängliga linjer...

source: Loading departures...
fi: Ladataan lähtöjä...
sv: Laddar avgångar...

source: Loading nearby stops
fi: Ladataan lähipysäkkejä
sv: Laddar närliggande stationer

source: Loading stops...
fi: Ladataan pysäkkejä...
sv: Laddar stationer...

source: Loading...
fi: Ladataan...
sv: Laddar...

source: Location
fi: Sijainti
sv: Plats

source: Location enabled
fi: Sijainti käytössä
sv: Plats aktiverad

source: Location Permissions
fi: Sijaintioikeudet
sv: Platsbehörigheter

source: Long-press your lock screen
fi: Paina pitkään lukitusnäyttöä
sv: Tryck länge på din låsskärm

source: Map
fi: Kartta
sv: Karta

source: Maybe later
fi: Ehkä myöhemmin
sv: Kanske senare

source: min late
fi: min myöhässä
sv: min försenad

source: Next Departures
fi: Seuraavat lähdöt
sv: Nästa avgångar

source: No departures available
fi: Ei lähtöjä saatavilla
sv: Inga avgångar tillgängliga

source: No favorite stops selected
fi: Ei valittuja suosikkipysäkkejä
sv: Inga favoritstationer valda

source: No favorites
fi: Ei suosikkeja
sv: Inga favoriter

source: No lines available
fi: Ei linjoja saatavilla
sv: Inga linjer tillgängliga

source: Not Requested
fi: Ei pyydetty
sv: Ej begärd

source: Number of departures
fi: Lähtöjen määrä
sv: Antal avgångar

source: Only show departures whose destination contains this text (case insensitive)
fi: Näytä vain lähdöt, joiden määränpää sisältää tämän tekstin
sv: Visa endast avgångar vars destination innehåller denna text

source: Open Settings
fi: Avaa asetukset
sv: Öppna inställningar

source: Open the app to select favorite stops
fi: Avaa sovellus valitaksesi suosikkipysäkit
sv: Öppna appen för att välja favoritstationer

source: Permission Status
fi: Oikeuksien tila
sv: Behörighetsstatus

source: Remove
fi: Poista
sv: Ta bort

source: Remove All
fi: Poista kaikki
sv: Ta bort alla

source: Remove All Favorites
fi: Poista kaikki suosikit
sv: Ta bort alla favoriter

source: Remove All Favorites?
fi: Poistetaanko kaikki suosikit?
sv: Ta bort alla favoriter?

source: Reset All Data
fi: Nollaa kaikki tiedot
sv: Återställ all data

source: Restricted
fi: Rajoitettu
sv: Begränsad

source: Save
fi: Tallenna
sv: Spara

source: Save the stops you use most. The widget will show whichever one is closest to you.
fi: Tallenna eniten käyttämäsi pysäkit. Widget näyttää aina lähimmän pysäkin.
sv: Spara de stationer du använder mest. Widgeten visar den som är närmast dig.

source: Search by name or code
fi: Hae nimellä tai koodilla
sv: Sök efter namn eller kod

source: See real-time bus and tram times right on your lock screen. No app needed.
fi: Näe reaaliaikaiset bussi- ja raitiovaunuajat suoraan lukitusnäytölläsi. Sovellusta ei tarvita.
sv: Se realtidsavgångar för buss och spårvagn direkt på din låsskärm. Ingen app behövs.

source: Select specific lines to show, or show all lines from this stop
fi: Valitse näytettävät linjat tai näytä kaikki tämän pysäkin linjat
sv: Välj specifika linjer att visa, eller visa alla linjer från denna station

source: Select Stops
fi: Valitse pysäkit
sv: Välj stationer

source: Settings
fi: Asetukset
sv: Inställningar

source: Show all lines
fi: Näytä kaikki linjat
sv: Visa alla linjer

source: Show your nearest stop
fi: Näytä lähin pysäkkisi
sv: Visa din närmaste station

source: Stop Information
fi: Pysäkkitiedot
sv: Stationsinformation

source: Tap "Customize"
fi: Napauta "Muokkaa"
sv: Tryck på "Anpassa"

source: Tap any stop to show only specific lines or destinations on your widget.
fi: Napauta mitä tahansa pysäkkiä näyttääksesi vain tietyt linjat tai määränpäät widgetissäsi.
sv: Tryck på valfri station för att bara visa specifika linjer eller destinationer på din widget.

source: Tap the area above or below the time
fi: Napauta aluetta kellonajan ylä- tai alapuolella
sv: Tryck på området ovanför eller under tiden

source: Tap the button below to select your favorite stops
fi: Napauta alla olevaa painiketta valitaksesi suosikkipysäkkisi
sv: Tryck på knappen nedan för att välja dina favoritstationer

source: This feature uses "significant location changes" which only triggers when you move approximately 500 meters. It does not continuously track your location.
fi: Tämä ominaisuus käyttää "merkittäviä sijaintimuutoksia", joka aktivoituu vain kun liikut noin 500 metriä. Se ei seuraa sijaintiasi jatkuvasti.
sv: Denna funktion använder "betydande platsändringar" som bara aktiveras när du rör dig ungefär 500 meter. Den spårar inte din plats kontinuerligt.

source: This only happens once in a while
fi: Tämä tapahtuu vain silloin tällöin
sv: Detta händer bara då och då

source: This will permanently remove all your favorite stops. This action cannot be undone.
fi: Tämä poistaa pysyvästi kaikki suosikkipysäkkisi. Tätä toimintoa ei voi peruuttaa.
sv: Detta tar permanent bort alla dina favoritstationer. Denna åtgärd kan inte ångras.

source: This will remove all favorite stops from your list.
fi: Tämä poistaa kaikki suosikkipysäkit listaltasi.
sv: Detta tar bort alla favoritstationer från din lista.

source: To enable background location updates, you need to grant "Always" permission in Settings. Tap the button above to open Settings.
fi: Ottaaksesi käyttöön taustapaikannuspäivitykset, sinun täytyy myöntää "Aina"-oikeus Asetuksissa. Napauta yllä olevaa painiketta avataksesi Asetukset.
sv: För att aktivera bakgrundsplatsuppdateringar måste du bevilja "Alltid"-behörighet i Inställningar. Tryck på knappen ovan för att öppna Inställningar.

source: To:
fi: Kohde:
sv: Till:

source: Unknown
fi: Tuntematon
sv: Okänd

source: When enabled, the widget will automatically update to show the nearest stop as you move around the city.
fi: Kun tämä on käytössä, widget päivittyy automaattisesti näyttämään lähimmän pysäkin liikkuessasi kaupungissa.
sv: När den är aktiverad uppdateras widgeten automatiskt för att visa närmaste station när du rör dig i staden.

source: While Using App
fi: Sovellusta käytettäessä
sv: Vid användning av app

source: Widget Display
fi: Widgetin näyttö
sv: Widgetvisning

source: You can also add a widget to your home screen.
fi: Voit myös lisätä widgetin kotinäytöllesi.
sv: Du kan också lägga till en widget på din hemskärm.

source: You can enable automatic updates when you move in Settings.
fi: Voit ottaa automaattiset päivitykset käyttöön Asetuksissa.
sv: Du kan aktivera automatiska uppdateringar när du rör dig i Inställningar.

source: Your departures at a glance
fi: Lähtösi yhdellä silmäyksellä
sv: Dina avgångar med en blick

source: Add to Favorites
sv: Lägg till i favoriter

source: Directions
sv: Vägbeskrivningar

source: My Widget
sv: Min widget

source: No departures
sv: Inga avgångar

source: P%@
sv: S%@

source: Remove from Favorites
sv: Ta bort från favoriter

source: Skip
sv: Hoppa över

source: This is an example widget.
sv: Detta är ett exempel på en widget.
